archive/before-2018-11-10/2018-06-14-玩玩inotify.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2018-06-14-玩玩inotify</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">2018-06-14-玩玩inotify</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org79a6da5">1. 什么是inotify</a></li>
<li><a href="#org7030c19">2. 实际需求</a></li>
<li><a href="#org489af33">3. 简单的例子</a></li>
<li><a href="#org2b2ab8f">4. 需要注意</a></li>
</ul>
</div>
</div>

<div id="outline-container-org79a6da5" class="outline-2">
<h2 id="org79a6da5"><span class="section-number-2">1</span> 什么是inotify</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
DESCRIPTION
       The  inotify API provides a mechanism for monitoring filesystem events.
       Inotify can be used to monitor individual files, or to monitor directo‐
       ries.   When  a  directory is monitored, inotify will return events for
       the directory itself, and for files inside the directory.
</pre>
<p>
直接翻译过来就是：提供一个机制用来监控文件系统的事件。
</p>
</div>
</div>

<div id="outline-container-org7030c19" class="outline-2">
<h2 id="org7030c19"><span class="section-number-2">2</span> 实际需求</h2>
<div class="outline-text-2" id="text-2">
<p>
我们设备的日志文件先是存在内存中的，现在需求是内存中的日志文件到达一
定大小Max_size时，就需要刷入flash中做持久化。那么怎么判断日志文件是
否到达Max_size呢？
</p>

<p>
最简单的方法是写一个循环一直不停地检测文件大小，但是这样很低效。
</p>

<p>
inotify在这种情况下就比较适用。具体方法就是用户进程使用inotify给内核
注册它所关心的文件。当文件发生改变时等事件时（可以在注册时选择关心的
事件），内核会通知用户程序。
</p>

<p>
这样通过inotify，上述需求可以这样完成：在每次文件修改时检测文件大小，
如果超过Max_size就刷入flash中。
</p>
</div>
</div>

<div id="outline-container-org489af33" class="outline-2">
<h2 id="org489af33"><span class="section-number-2">3</span> 简单的例子</h2>
<div class="outline-text-2" id="text-3">
<p>
这是inotify的测试程序，可以直接跟需要跟踪的目录或者文件 <code>./main
  /tmp/temp/1</code> ：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;errno.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;poll.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;sys/inotify.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;unistd.h&gt;</span>

<span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Read all available inotify events from the file descriptor 'fd'.</span>
<span style="color: #6c6c6c; font-style: italic;">   wd is the table of watch descriptors for the directories in argv.</span>
<span style="color: #6c6c6c; font-style: italic;">   argc is the length of wd and argv.</span>
<span style="color: #6c6c6c; font-style: italic;">   argv is the list of watched directories.</span>
<span style="color: #6c6c6c; font-style: italic;">   Entry 0 of wd and argv is unused. </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

<span style="color: #a1db00;">static</span> <span style="color: #00d7af;">void</span>
<span style="color: #ffd700;">handle_events</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">fd</span>, <span style="color: #00d7af;">int</span> *<span style="color: #ff8700;">wd</span>, <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>, <span style="color: #00d7af;">char</span>* <span style="color: #ff8700;">argv</span>[])
{
    <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Some systems cannot read integer variables if they are not</span>
<span style="color: #6c6c6c; font-style: italic;">       properly aligned. On other systems, incorrect alignment may</span>
<span style="color: #6c6c6c; font-style: italic;">       decrease performance. Hence, the buffer used for reading from</span>
<span style="color: #6c6c6c; font-style: italic;">       the inotify file descriptor should have the same alignment as</span>
<span style="color: #6c6c6c; font-style: italic;">       struct inotify_event. </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

    <span style="color: #00d7af;">char</span> <span style="color: #ff8700;">buf</span>[4096]
        <span style="color: #a1db00;">__attribute__</span> ((aligned(__alignof__(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">inotify_event</span>))));
    <span style="color: #a1db00;">const</span> <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">inotify_event</span> *<span style="color: #ff8700;">event</span>;
    <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">i</span>;
    <span style="color: #00d7af;">ssize_t</span> <span style="color: #ff8700;">len</span>;
    <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">ptr</span>;

    <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Loop while events can be read from inotify file descriptor. </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

    <span style="color: #a1db00;">for</span> (;;)
    {

        <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Read some events. </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

        len = read(fd, buf, <span style="color: #a1db00;">sizeof</span> buf);
        <span style="color: #a1db00;">if</span> (len == -1 &amp;&amp; errno != EAGAIN) {
            perror(<span style="color: #ff4ea3;">"read"</span>);
            exit(EXIT_FAILURE);
        }

        <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">If the nonblocking read() found no events to read, then</span>
<span style="color: #6c6c6c; font-style: italic;">           it returns -1 with errno set to EAGAIN. In that case,</span>
<span style="color: #6c6c6c; font-style: italic;">           we exit the loop. </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

        <span style="color: #a1db00;">if</span> (len &lt;= 0)
            <span style="color: #a1db00;">break</span>;

        <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Loop over all events in the buffer </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

        <span style="color: #a1db00;">for</span> (ptr = buf; ptr &lt; buf + len;
             ptr += <span style="color: #a1db00;">sizeof</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">inotify_event</span>) + event-&gt;len) {

            event = (<span style="color: #a1db00;">const</span> <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">inotify_event</span> *) ptr;

            <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Print event type </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

            <span style="color: #a1db00;">if</span> (event-&gt;mask &amp; IN_OPEN)
                printf(<span style="color: #ff4ea3;">"IN_OPEN: "</span>);

            <span style="color: #a1db00;">if</span> (event-&gt;mask &amp; IN_CLOSE_NOWRITE)
                printf(<span style="color: #ff4ea3;">"IN_CLOSE_NOWRITE: "</span>);

            <span style="color: #a1db00;">if</span> (event-&gt;mask &amp; IN_CLOSE_WRITE)
                printf(<span style="color: #ff4ea3;">"IN_CLOSE_WRITE: "</span>);

            <span style="color: #a1db00;">if</span> (event-&gt;mask &amp; IN_MODIFY)
                printf(<span style="color: #ff4ea3;">"IN_MODIFY: "</span>);

            <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Print the name of the watched directory </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

            <span style="color: #a1db00;">for</span> (i = 1; i &lt; argc; ++i) {
                <span style="color: #a1db00;">if</span> (wd[i] == event-&gt;wd) {
                    printf(<span style="color: #ff4ea3;">"%s/"</span>, argv[i]);
                    <span style="color: #a1db00;">break</span>;
                }
            }

            <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Print the name of the file </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

            <span style="color: #a1db00;">if</span> (event-&gt;len)
                printf(<span style="color: #ff4ea3;">"%s"</span>, event-&gt;name);

            <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Print type of filesystem object </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

            <span style="color: #a1db00;">if</span> (event-&gt;mask &amp; IN_ISDIR)
                printf(<span style="color: #ff4ea3;">" [directory]\n"</span>);
            <span style="color: #a1db00;">else</span>
                printf(<span style="color: #ff4ea3;">" [file]\n"</span>);
        }
    }
}

<span style="color: #00d7af;">int</span>
<span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>, <span style="color: #00d7af;">char</span>* <span style="color: #ff8700;">argv</span>[])
{
    <span style="color: #00d7af;">char</span>           <span style="color: #ff8700;">buf</span>;
    <span style="color: #00d7af;">int</span>            <span style="color: #ff8700;">fd</span>, <span style="color: #ff8700;">i</span>, <span style="color: #ff8700;">poll_num</span>;
    <span style="color: #00d7af;">int</span>           *<span style="color: #ff8700;">wd</span>;
    <span style="color: #00d7af;">nfds_t</span>         <span style="color: #ff8700;">nfds</span>;
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">pollfd</span>  <span style="color: #ff8700;">fds</span>[2];

    <span style="color: #a1db00;">if</span> (argc &lt; 2) {
        printf(<span style="color: #ff4ea3;">"Usage: %s PATH [PATH ...]\n"</span>, argv[0]);
        exit(EXIT_FAILURE);
    }

    printf(<span style="color: #ff4ea3;">"Press ENTER key to terminate.\n"</span>);

    <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Create the file descriptor for accessing the inotify API </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

    fd = inotify_init1(IN_NONBLOCK);
    <span style="color: #a1db00;">if</span> (fd == -1) {
        perror(<span style="color: #ff4ea3;">"inotify_init1"</span>);
        exit(EXIT_FAILURE);
    }

    <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Allocate memory for watch descriptors </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

    wd = calloc(argc, <span style="color: #a1db00;">sizeof</span>(<span style="color: #00d7af;">int</span>));
    <span style="color: #a1db00;">if</span> (wd == <span style="color: #5fafd7;">NULL</span>) {
        perror(<span style="color: #ff4ea3;">"calloc"</span>);
        exit(EXIT_FAILURE);
    }

    <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Mark directories for events</span>
<span style="color: #6c6c6c; font-style: italic;">       - file was opened</span>
<span style="color: #6c6c6c; font-style: italic;">       - file was closed </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

    <span style="color: #a1db00;">for</span> (i = 1; i &lt; argc; i++) {
        wd[i] = inotify_add_watch(fd, argv[i],
                                  IN_OPEN | IN_CLOSE | IN_MODIFY);
        <span style="color: #a1db00;">if</span> (wd[i] == -1) {
            fprintf(stderr, <span style="color: #ff4ea3;">"Cannot watch '%s'\n"</span>, argv[i]);
            perror(<span style="color: #ff4ea3;">"inotify_add_watch"</span>);
            exit(EXIT_FAILURE);
        }
    }

    <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Prepare for polling </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

    nfds = 2;

    <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Console input </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

    fds[0].fd = STDIN_FILENO;
    fds[0].events = POLLIN;

    <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Inotify input </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

    fds[1].fd = fd;
    fds[1].events = POLLIN;

    <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Wait for events and/or terminal input </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

    printf(<span style="color: #ff4ea3;">"Listening for events.\n"</span>);
    <span style="color: #a1db00;">while</span> (1) {
        poll_num = poll(fds, nfds, -1);
        <span style="color: #a1db00;">if</span> (poll_num == -1) {
            <span style="color: #a1db00;">if</span> (errno == EINTR)
                <span style="color: #a1db00;">continue</span>;
            perror(<span style="color: #ff4ea3;">"poll"</span>);
            exit(EXIT_FAILURE);
        }

        <span style="color: #a1db00;">if</span> (poll_num &gt; 0) {

            <span style="color: #a1db00;">if</span> (fds[0].revents &amp; POLLIN) {

                <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Console input is available. Empty stdin and quit </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

                <span style="color: #a1db00;">while</span> (read(STDIN_FILENO, &amp;buf, 1) &gt; 0 &amp;&amp; buf != <span style="color: #ff4ea3;">'\n'</span>)
                    <span style="color: #a1db00;">continue</span>;
                <span style="color: #a1db00;">break</span>;
            }

            <span style="color: #a1db00;">if</span> (fds[1].revents &amp; POLLIN) {

                <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Inotify events are available </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

                handle_events(fd, wd, argc, argv);
            }
        }
    }

    printf(<span style="color: #ff4ea3;">"Listening for events stopped.\n"</span>);

    <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">Close inotify file descriptor </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

    close(fd);

    free(wd);
    exit(EXIT_SUCCESS);
}

</pre>
</div>

<p>
使用一个测试程序不停地去写 <code>/tmp/temp/1</code> 文件，这样上面程序中可以收
到notify了：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;unistd.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;string.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;fcntl.h&gt;</span>

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>()
{
    <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">fd</span> = open(<span style="color: #ff4ea3;">"/tmp/temp/1"</span>, O_RDWR | O_APPEND | O_CREAT);

    <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">buf</span> = <span style="color: #ff4ea3;">"hello,world\n"</span>;

    <span style="color: #a1db00;">while</span>(1)
    {
        write(fd, buf, 4);

        sleep(1);
    }

    <span style="color: #a1db00;">return</span> 0;
}
</pre>
</div>

<p>
makefile文件如下：
</p>
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #ffd700;">.PHONY</span>:a.out
<span style="color: #ffd700;">a.out</span>:
        cc -o main main.c
        cc -o test test.c
<span style="color: #ffd700;">clean</span>:
        rm -rfv *~ a.out
</pre>
</div>
</div>
</div>

<div id="outline-container-org2b2ab8f" class="outline-2">
<h2 id="org2b2ab8f"><span class="section-number-2">4</span> 需要注意</h2>
<div class="outline-text-2" id="text-4">
<p>
刚开始使用的时候， <code>main</code> 程序老是报错。
</p>
<pre class="example">
  ➜  inotify ./a.out /tmp /tmp/temp
Press ENTER key to terminate.
Cannot watch '/tmp'
inotify_add_watch: No space left on device
</pre>

<p>
搜索了一下，我理解应该是系统中，inotify有一个允计用户设置notify的最
大值。ubuntu上直接调用 <code>sudo sysctl fs.inotify.max_user_watches</code> 可
以查看一下当前设置值：
</p>
<pre class="example">
➜  inotify sudo sysctl fs.inotify.max_user_watches
fs.inotify.max_user_watches = 8192
</pre>

<p>
如果出现这个错误，应该当前系统已经达到配置值的上限了。需要改大一点：
</p>
<pre class="example">
  ➜  inotify sudo sysctl fs.inotify.max_user_watches=81920
fs.inotify.max_user_watches = 81920
</pre>

<p>
如果把这个配置持久化，需要修改 <code>sysctl</code> 的配置文件
<code>/etc/sysctl.conf</code> ，把 <code>fs.inotify.max_user_watches = 81920</code> 加入到
文件中即可。<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara">这个我没有实际测试过，不过大致应该差不多。</div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>